<?php

namespace Database\Seeders;

use App\Models\AccessLevel;
use Illuminate\Database\Seeder;

class Roles extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        AccessLevel::insert([
            ['id'=>106, 'name'=>'افزودن سطح دسترسی'],
            ['id'=>107, 'name'=>'ویرایش سطح دسترسی'],
            ['id'=>108, 'name'=>'منو برنامه هفتگی'],
            ['id'=>109, 'name'=>'افزودن برنامه هفتگی'],
            ['id'=>110, 'name'=>'ویرایش برنامه هفتگی'],
            ['id'=>111, 'name'=>'حذف برنامه هفتگی'],
            ['id'=>112, 'name'=>'منو تنظیمات'],
            ['id'=>113, 'name'=>'اسلایدر'],
            ['id'=>114, 'name'=>'افزودن عکس'],
            ['id'=>115, 'name'=>'ویرایش عکس'],
            ['id'=>116, 'name'=>'حذف عکس'],
            ['id'=>117, 'name'=>'اطلاعیه'],
            ['id'=>118, 'name'=>'افزودن اطلاعیه'],
            ['id'=>119, 'name'=>'ویرایش اطلاعیه'],
            ['id'=>120, 'name'=>'حذف اطلاعیه'],
            ['id'=>121, 'name'=>'منو نیمسال'],
            ['id'=>122, 'name'=>'افزودن نیمسال'],
            ['id'=>123, 'name'=>'ویرایش نیمسال'],
            ['id'=>124, 'name'=>'حذف نیمسال'],
            ['id'=>125, 'name'=>'منو چارت تحصیلی'],
            ['id'=>126, 'name'=>'افزودن چارت تحصیلی'],
            ['id'=>127, 'name'=>'ویرایش چارت تحصیلی'],
            ['id'=>128, 'name'=>'حذف چارت تحصیلی'],
            ['id'=>129, 'name'=>'منون صندوق پیام'],
            ['id'=>130, 'name'=>'حذف پیام'],
            ['id'=>131, 'name'=>'منو لینک کلاس ها'],
            ['id'=>132, 'name'=>'افزودن لینک کلاس'],
            ['id'=>133, 'name'=>'ویرایش لینک کلاس'],

        ]);
    }
}
